{
    "roles": [
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "title": "Engineer",
            "description": "Implement designs into clean, modular, and performant code, focusing on responsive design and accessibility."
        },
        {
            "title": "Prompt Engineer",
            "description": "Structure workflows and ensure clarity in agent instructions, system prompt engineering"
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor (flash)",
            "description": "Identify and return each 'Task Agnostic Step' (TAS) towards the high-level goal."
        }
    ],
    "steps": [
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Deconstruct the high-level goal, 'Implementation of Hierarchical AI Team Orchestration', into foundational phases and core components."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Based on the initial phases from uTASe, design the agent communication protocol and the logical workflow for task delegation, progress tracking, and result synthesis. Define the initial system prompts for each role."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Design the UI/UX for the orchestration management dashboard. Create wireframes and mockups for visualizing the agent hierarchy, task assignments, communication logs, and overall system status, based on the workflow from Lyra."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Develop the front-end for the orchestration dashboard based on Aurora's designs and implement the back-end infrastructure to support the agent communication protocol and workflow logic defined by Lyra."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Integrate and refine the role-specific system prompts into the back-end system built by Kodax. Develop dynamic prompt templates that can be populated with real-time task data."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Review the implemented dashboard for visual consistency, usability, and adherence to the original design specifications. Provide feedback for UI/UX refinements."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Incorporate feedback from Aurora to polish the UI. Perform integration testing to ensure the front-end and back-end systems are communicating flawlessly."
        },
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Analyze the completed system and extract a comprehensive, step-by-step testing and validation plan to ensure all orchestration functionalities meet the high-level goal."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Execute the testing plan from uTASe, leading the final validation of the end-to-end orchestration flow. Document the final system prompts and operational guidelines for deployment."
        }
    ]
}