{
    "roles": [
        {
            "title": "Task-Agnostic Step (TAS) extractor (flash)",
            "description": "Deconstruct the high-level goal of creating the API-driven Humor Evaluator into a clear, sequential, and actionable task plan for the team."
        },
        {
            "title": "Engineer",
            "description": "Implement the full-stack application, focusing on creating a robust API client for https://ai.violass.club/v1, building the user interface based on the designer's specifications, and integrating the prompt-driven logic."
        },
        {
            "title": "Prompt Engineer",
            "description": "Develop, test, and refine all LLM prompts for joke generation, feedback analysis, and personalized recommendations, ensuring they are optimized for the https://ai.violass.club/v1 API."
        },
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows for the Humor Evaluator, ensuring an intuitive and accessible user experience for joke interaction and feedback."
        }
    ],
    "steps": [
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Deconstruct the high-level goal into a sequence of actionable tasks for implementing the Humor Evaluator system with the specified API."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Investigate the `https://ai.violass.club/v1` API documentation to determine authentication methods, request/response formats, and any rate limits. Create a preliminary technical plan for integration."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Collaborate with the Engineer to understand API constraints and draft initial prompt structures for joke generation and feedback analysis that are compatible with the target API."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Design the user interface and user flow for the Humor Evaluator. This includes screens for displaying jokes, collecting user ratings/feedback, and showing personalized recommendations."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Develop a modular and reusable API client in the chosen programming language to handle all communications with the `https://ai.violass.club/v1` endpoint."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Finalize and test the core set of prompts for generating jokes, analyzing user feedback, and making recommendations. Use a testing tool to validate prompt effectiveness directly with the API."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Implement the front-end UI based on the Designer's specifications, creating components for joke display, feedback input, and recommendation lists."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Integrate the API client and the finalized prompts into the application's backend logic. Connect the front-end UI to trigger the appropriate API calls and display the results."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Conduct an end-to-end review of the integrated system, analyzing the quality of the LLM's outputs and iteratively refining the prompts to improve performance and user satisfaction."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Perform final integration testing, bug fixing, and prepare the complete Humor Evaluator application for deployment."
        }
    ]
}