{
    "steps": [
        {
            "role": "Task-Agnostic Step (TAS) extractor",
            "task": "Analyze the high-level goal 'refactoring' to identify Task-Agnostic Steps (TAS) applicable to any refactoring project. These steps are independent of the specific codebase or design."
        },
        {
            "role": "Prompt Engineer",
            "task": "Refine the prompts for the Designer and Engineer roles to ensure clarity and focus on the refactoring goals, including accessibility and performance considerations."
        },
        {
            "role": "Designer",
            "task": "Identify UI/UX components that may need refactoring based on current design trends and accessibility guidelines. Create mockups of potential improvements, focusing on visual clarity and user experience."
        },
        {
            "role": "Engineer",
            "task": "Analyze the existing codebase to identify areas that require refactoring based on code quality, performance bottlenecks, and maintainability. Prioritize areas that align with the Designer's proposed UI/UX improvements."
        },
        {
            "role": "Prompt Engineer",
            "task": "Based on the Designer's mockups and the Engineer's code analysis, refine prompts for both roles to address specific refactoring tasks, ensuring alignment with the overall goal."
        },
        {
            "role": "Designer",
            "task": "Develop detailed design specifications for the refactored UI/UX components, including color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "role": "Engineer",
            "task": "Implement the design specifications by refactoring the codebase, focusing on clean, modular, and performant code. Ensure responsive design and accessibility are maintained throughout the refactoring process."
        },
        {
            "role": "Engineer",
            "task": "Conduct thorough testing of the refactored code to ensure functionality, performance, and accessibility. Address any issues identified during testing."
        },
        {
            "role": "Designer",
            "task": "Review the implemented refactoring changes to ensure they align with the design specifications and maintain visual consistency and user experience. Provide feedback to the Engineer for any necessary adjustments."
        },
        {
            "role": "Prompt Engineer",
            "task": "Evaluate the effectiveness of the prompts used throughout the refactoring process and identify areas for improvement in future refactoring projects."
        }
    ]
}