{
    "roles": [
        {
            "title": "Designer",
            "description": "Designs the user interface and experience for the data annotation and review tool, ensuring it is intuitive, efficient, and accessible."
        },
        {
            "title": "Engineer",
            "description": "Builds and maintains the data collection, annotation, and processing pipeline, including the user-facing tool and data packaging scripts."
        },
        {
            "title": "Prompt Engineer",
            "description": "Defines the dataset schema, structures the data generation workflow, engineers prompts for TAS extraction, and oversees the quality control process."
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor",
            "description": "Processes raw input data (e.g., high-level goals, project plans) to identify and extract Task-Agnostic Steps (TAS)."
        }
    ],
    "steps": [
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Define the schema and format for the fine-tuning dataset, specifying the structure of input (e.g., high-level goal) and output (e.g., extracted TAS)."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Establish criteria for sourcing raw data and create a plan for gathering diverse examples of high-level goals and project descriptions."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Design a user-friendly interface for annotating, reviewing, and validating the extracted TAS data to ensure dataset quality."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Implement the front-end and back-end for the data annotation and review tool based on Aurora's design."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Develop and refine the system prompts for uTASe to maximize the accuracy and relevance of the extracted TAS."
        },
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor",
            "task": "Execute the primary extraction process by analyzing the sourced raw data to identify and list all Task-Agnostic Steps."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Structure the raw output from uTASe into the predefined dataset schema, creating clean prompt-completion pairs for the LLM."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Write and deploy scripts to automate the final packaging of the validated dataset into a machine-readable format (e.g., JSONL) suitable for fine-tuning."
        }
    ]
}