{
    "roles": [
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "title": "Engineer",
            "description": "Implement designs into clean, modular, and performant code, focusing on responsive design and accessibility."
        },
        {
            "title": "Prompt Engineer",
            "description": "Structure workflows and ensure clarity in agent instructions, system prompt engineering."
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor (flash)",
            "description": "Identify and return each 'Task Agnostic Step' (TAS) towards the high-level goal."
        }
    ],
    "steps": [
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Extract the primary Task-Agnostic Steps (TAS) for creating the AI frontend website, establishing a high-level project roadmap."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Synthesize the TAS from uTASe into a coherent project plan and define the initial system prompt for the AI this website will interface with."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Based on the project plan, create low-fidelity wireframes and define the core user interaction flow for the AI frontend."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Review the wireframes for technical feasibility and set up the initial project structure, including framework selection and repository creation."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Develop a high-fidelity visual design system, including a color palette, typography, and component mockups based on the approved wireframes."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Translate the high-fidelity designs into responsive and accessible frontend components using modular code."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Refine the AI's system prompt and create user-facing microcopy (button text, instructions, placeholders) that aligns with the UI and guides the user effectively."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Integrate the frontend components into a cohesive application and connect to the AI system's API endpoints."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Conduct a design review of the implemented website to ensure it aligns with the high-fidelity mockups and accessibility standards."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Perform end-to-end testing of the user flow, focusing on the clarity of instructions and the quality of the AI interaction."
        },
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Identify the next steps for iteration, such as user feedback collection, feature enhancement, or performance optimization."
        }
    ]
}