{
    "roles": [
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "title": "Engineer",
            "description": "Implement designs into clean, modular, and performant code, focusing on responsive design and accessibility."
        },
        {
            "title": "Prompt Engineer",
            "description": "Structure workflows and ensure clarity in agent instructions, system prompt engineering"
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor",
            "description": "Identify and extract each 'Task Agnostic Step' (TAS) towards the high-level goal."
        }
    ],
    "steps": [
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Define the JSON schema for the fine-tuning dataset. The schema must structure entries as pairs of 'high-level goal' and its corresponding 'TAS plan'."
        },
        {
            "name": "TASe",
            "role": "Task-Agnostic Step (TAS) extractor",
            "task": "Generate 10 diverse, high-quality seed examples of TAS plans based on the schema defined by Lyra. These examples will serve as the foundation for the dataset."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Design a minimalist and intuitive user interface for a data annotation tool. The UI should allow users to input a high-level goal, view a generated TAS plan, and then edit, approve, or reject the plan."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Develop the front-end and back-end for the data annotation tool based on Aurora's designs. Ensure the tool can store and export the validated dataset in the required JSON format."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Engineer a set of system prompts for an LLM to be integrated into the annotation tool. These prompts will guide the LLM to generate accurate TAS plans from user-submitted high-level goals."
        },
        {
            "name": "TASe",
            "role": "Task-Agnostic Step (TAS) extractor",
            "task": "Utilize the annotation tool to generate and validate a dataset of at least 500 entries. Focus on quality, ensuring each TAS plan is logical, complete, and correctly structured."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Perform a final quality assurance check on the entire dataset. Sanitize the data, verify schema compliance for all entries, and prepare the final dataset file for the fine-tuning process."
        }
    ]
}