{
    "roles": [
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "title": "Engineer",
            "description": "Implement designs into clean, modular, and performant code, focusing on responsive design and accessibility."
        },
        {
            "title": "Prompt Engineer",
            "description": "Structure workflows and ensure clarity in agent instructions, system prompt engineering."
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor",
            "description": "Identify and extract each 'Task Agnostic Step' (TAS) towards the high-level goal."
        }
    ],
    "steps": [
        {
            "name": "TASe",
            "role": "Task-Agnostic Step (TAS) extractor",
            "task": "Analyze the high-level goal to deconstruct it into a comprehensive, step-by-step plan, defining the key stages of application development from concept to deployment."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Develop the initial system prompt for the core humor generation AI. This prompt must define a unique comedic persona, establish rules for generating 'genuinely fresh' humor, and set parameters for joke structure and content."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Create high-fidelity mockups and a complete UI/UX design for the humor evaluation application. This includes the main joke display interface, an intuitive user feedback mechanism (e.g., multi-axis rating system), and the overall visual identity."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Develop the front-end and back-end scaffolding for the application based on Aurora's designs. This includes setting up the database schema for storing jokes and user feedback, and building the basic API endpoints."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Design the architecture for the feedback loop. Define how raw user feedback data will be quantitatively and qualitatively analyzed to create actionable insights for prompt modification."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Implement the feedback data processing pipeline. Integrate the humor generation AI via API and connect the user feedback mechanism to the database, ensuring data is stored accurately."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Create the 'strategic adjustment' meta-prompting system. This system will take the analyzed feedback insights as input and programmatically modify the core humor generation prompt to enhance its performance."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Integrate the strategic adjustment system into the back-end, creating an automated workflow where user feedback continuously refines the AI's humor generation prompt over time."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Conduct a final design review and polish the user interface. Create any necessary micro-interactions or visual feedback elements to enhance the user experience, ensuring the application is engaging and easy to use."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Deploy the fully integrated application to a production environment. Perform end-to-end testing to validate that the humor generation, feedback loop, and strategic adjustment mechanisms are all functioning cohesively."
        }
    ]
}