[
  {
    "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
    "name": "Define High-Level Goal",
    "description": "Clearly articulate and document the overarching objective that the system or project aims to achieve. This involves understanding the desired end-state, its purpose, and its significance.",
    "category": "Init",
    "purpose": "Establish a clear and unified understanding of the ultimate aim.",
    "keywords": ["goal setting", "objective definition", "vision", "purpose"],
    "applicability_notes": "This is a universal first step in any project or initiative, regardless of domain. It sets the direction for all subsequent actions.",
    "examples_of_usage": [
      "Defining the goal for a new software feature.",
      "Stating the objective of a marketing campaign.",
      "Articulating the mission of a non-profit organization."
    ],
    "typical_inputs": ["stakeholder input", "market analysis", "strategic vision document"],
    "typical_outputs": ["clearly defined high-level goal statement", "project charter"
    ]
  },
  {
    "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef1",
    "name": "Analyze Context",
    "description": "Gather and process all relevant background information, constraints, environmental factors, and existing conditions that pertain to the high-level goal. This includes understanding the current state and potential influencing factors.",
    "category": "Analysis",
    "purpose": "Gain a comprehensive understanding of the environment and factors influencing the goal.",
    "keywords": ["research", "information gathering", "situational analysis", "environmental scan"],
    "applicability_notes": "Crucial for informed decision-making and strategy formulation. Applicable in strategic planning, problem-solving, and design processes.",
    "examples_of_usage": [
      "Analyzing the competitive landscape before launching a product.",
      "Assessing user needs and behaviors before designing an application.",
      "Understanding regulatory requirements for a new policy."
    ],
    "typical_inputs": ["project scope", "stakeholder interviews", "existing data", "market research"],
    "typical_outputs": ["context analysis report", "identified constraints and opportunities", "situational assessment"
    ]
  },
  {
    "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef12",
    "name": "Define Roles",
    "description": "Identify and assign specific responsibilities, authorities, and accountabilities to individuals or teams involved in achieving the high-level goal. This clarifies who is responsible for what.",
    "category": "Init",
    "purpose": "Establish clear ownership and accountability for tasks and outcomes.",
    "keywords": ["team structure", "responsibility assignment", "accountability", "project roles"],
    "applicability_notes": "Essential for project management, team collaboration, and operational efficiency across any structured endeavor.",
    "examples_of_usage": [
      "Assigning tasks to team members in a software development project.",
      "Defining roles in a committee responsible for an event.",
      "Establishing a command structure in an emergency response scenario."
    ],
    "typical_inputs": ["project plan", "task list", "organizational structure"],
    "typical_outputs": ["role definitions", "responsibility matrix (e.g., RACI)", "team roster"
    ]
  }
]