{
    "roles": [
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "title": "Engineer",
            "description": "Implement designs into clean, modular, and performant code, focusing on responsive design and accessibility."
        },
        {
            "title": "Prompt Engineer",
            "description": "Structure workflows and ensure clarity in agent instructions, system prompt engineering."
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor (flash)",
            "description": "Identify and return each 'Task Agnostic Step' (TAS) towards the high-level goal."
        }
    ],
    "steps": [
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Analyze the high-level goal and extract the primary phases of the project: Discovery, Design, Development, and Deployment."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Define the core purpose and interaction model of the AI system. Specify the types of user inputs and the desired AI outputs to guide the website's functional requirements."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Create low-fidelity wireframes and user flow diagrams based on the AI's interaction model to map out the user journey and interface structure."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Develop high-fidelity mockups and a comprehensive style guide, including color palette, typography, and component designs, for a cohesive visual identity."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Set up the frontend development environment, including selecting a framework (e.g., React, Vue), establishing a project structure, and initializing version control with Git."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Translate the high-fidelity mockups and style guide into modular, responsive, and accessible UI components using HTML, CSS, and JavaScript."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Engineer the precise system prompts and API data structures required for the frontend to communicate effectively with the AI backend."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Integrate the frontend UI components with the AI's backend API, implementing the logic to handle user requests and display AI responses."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Conduct a thorough design and UX review of the implemented application to ensure it aligns with the mockups and provides an intuitive user experience."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Perform end-to-end testing of the AI interaction flow, refining prompts based on real-world usage to improve response accuracy and relevance."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Perform final testing for performance, responsiveness, and cross-browser compatibility, and then deploy the completed website to a production environment."
        }
    ]
}