[
  {
    "id": "f4a6b2c1-4e8d-4f0a-8b9c-0d1e2f3a4b5c",
    "name": "Define Personal Values",
    "description": "Identify and articulate the core principles, beliefs, and ethical standards that guide an individual's life and decision-making. This involves introspection to understand what is fundamentally important and meaningful.",
    "category": "Init",
    "purpose": "Establish a foundational understanding of personal guiding principles.",
    "keywords": [
      "values",
      "principles",
      "ethics",
      "introspection",
      "self-awareness"
    ],
    "applicability_notes": "This step is crucial for aligning actions with one's authentic self. It's applicable in personal development, career choices, and relationship building.",
    "examples_of_usage": [
      "An individual reflects on their past decisions to identify recurring themes that brought satisfaction or dissatisfaction, leading to a clearer set of values.",
      "A team collaboratively defines shared values to guide their project's direction and team interactions.",
      "A student explores different philosophical viewpoints to determine their own ethical framework."
    ],
    "typical_inputs": [
      "Reflective prompts",
      "Life experiences",
      "Personal journaling"
    ],
    "typical_outputs": [
      "A prioritized list of personal values",
      "A personal values statement"
    ]
  },
  {
    "id": "e3b5a1d0-5f9e-4a1b-9c8d-1e2f3a4b5c6d",
    "name": "Assess Current State",
    "description": "Evaluate one's current situation across relevant life domains (e.g., career, health, relationships, personal growth) to establish a baseline understanding of strengths, weaknesses, opportunities, and challenges.",
    "category": "Analysis",
    "purpose": "Gain objective insight into the present situation.",
    "keywords": [
      "assessment",
      "self-evaluation",
      "current state",
      "SWOT analysis",
      "feedback"
    ],
    "applicability_notes": "Provides the necessary context for setting realistic goals and identifying areas for development. Can be applied to individuals, teams, or organizations.",
    "examples_of_usage": [
      "An individual conducts a 360-degree feedback review to understand their professional impact.",
      "A company analyzes its market position, internal resources, and competitive landscape.",
      "A student reviews their academic performance and identifies subjects needing more attention."
    ],
    "typical_inputs": [
      "Personal values",
      "Performance data",
      "Feedback from others",
      "Life domain inventories"
    ],
    "typical_outputs": [
      "Identified strengths and weaknesses",
      "Areas for improvement",
      "Current state summary"
    ]
  },
  {
    "id": "d2a4c0b9-6e0f-4b2c-8a7d-2e3f4a5b6c7d",
    "name": "Set Personal Goals",
    "description": "Formulate specific, measurable, achievable, relevant, and time-bound (SMART) objectives that align with defined values and address identified areas for growth. Goals should represent desired future states.",
    "category": "Init",
    "purpose": "Define clear targets for personal development.",
    "keywords": [
      "goals",
      "objectives",
      "SMART criteria",
      "planning",
      "future state"
    ],
    "applicability_notes": "Essential for directing effort and measuring progress. Applicable to all areas of life where improvement or achievement is desired.",
    "examples_of_usage": [
      "An individual sets a goal to read 12 books on personal finance within the next year.",
      "A startup aims to increase user engagement by 15% in the next quarter.",
      "A student sets a goal to achieve a GPA of 3.8 by the end of the academic year."
    ],
    "typical_inputs": [
      "Defined personal values",
      "Current state assessment",
      "Desired outcomes"
    ],
    "typical_outputs": [
      "A list of SMART goals",
      "Prioritized objectives"
    ]
  },
  {
    "id": "c1b3a9d8-7f1e-4c3d-9b6e-3f4a5b6c7d8e",
    "name": "Acquire Knowledge and Skills",
    "description": "Identify and engage in learning activities, such as reading, courses, workshops, or mentorship, to gain the necessary understanding and competencies required to achieve set goals.",
    "category": "Learning",
    "purpose": "Develop capabilities needed for goal achievement.",
    "keywords": [
      "learning",
      "skills",
      "knowledge",
      "education",
      "training",
      "development"
    ],
    "applicability_notes": "This is a continuous process that supports growth and adaptation. It's fundamental for mastering new areas or improving existing ones.",
    "examples_of_usage": [
      "An aspiring writer takes a creative writing course and reads extensively in their genre.",
      "A software developer learns a new programming language to contribute to a new project.",
      "An entrepreneur attends business strategy seminars."
    ],
    "typical_inputs": [
      "Set personal goals",
      "Identified skill gaps",
      "Recommended resources"
    ],
    "typical_outputs": [
      "Acquired knowledge",
      "Developed skills",
      "Certifications or credentials"
    ]
  },
  {
    "id": "b0a298c7-8e2f-4d4e-8c5f-4a5b6c7d8e9f",
    "name": "Take Action",
    "description": "Implement plans and strategies derived from goals and acquired knowledge. This involves engaging in consistent, deliberate actions towards the desired outcomes.",
    "category": "Action",
    "purpose": "Execute plans to move towards desired outcomes.",
    "keywords": [
      "action",
      "implementation",
      "execution",
      "practice",
      "doing"
    ],
    "applicability_notes": "The bridge between intention and reality. Consistent action, even small steps, is key to progress.",
    "examples_of_usage": [
      "A person consistently exercises for 30 minutes daily as per their fitness goal.",
      "A team implements the new feature designed for their software product.",
      "An artist dedicates two hours each day to painting."
    ],
    "typical_inputs": [
      "Set personal goals",
      "Action plans",
      "Acquired skills and knowledge"
    ],
    "typical_outputs": [
      "Progress towards goals",
      "Completed tasks",
      "Realized changes"
    ]
  },
  {
    "id": "a9b187b6-9f3e-4e5f-7d4a-5b6c7d8e9f0a",
    "name": "Reflect and Adjust",
    "description": "Regularly review progress made towards goals, analyze the effectiveness of actions taken, and make necessary adjustments to strategies, goals, or learning plans based on outcomes and new insights.",
    "category": "Analysis",
    "purpose": "Ensure continuous improvement and adaptability.",
    "keywords": [
      "reflection",
      "review",
      "adjustment",
      "adaptation",
      "feedback loop",
      "iteration"
    ],
    "applicability_notes": "This iterative process is vital for sustained growth and for navigating unforeseen challenges or opportunities. It turns experience into wisdom.",
    "examples_of_usage": [
      "A runner analyzes their race performance data to adjust their training regimen.",
      "A writer revises their manuscript based on feedback from beta readers.",
      "A project manager reviews project milestones and reallocates resources as needed."
    ],
    "typical_inputs": [
      "Progress reports",
      "Performance data",
      "Feedback received",
      "Outcomes of actions"
    ],
    "typical_outputs": [
      "Revised goals",
      "Updated strategies",
      "Learnings and insights"
    ]
  }
]