{
    "roles": [
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "title": "Engineer",
            "description": "Implement designs into clean, modular, and performant code, focusing on responsive design and accessibility."
        },
        {
            "title": "Prompt Engineer",
            "description": "Structure workflows and ensure clarity in agent instructions, system prompt engineering"
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor (flash)",
            "description": "Identify and return each 'Task Agnostic Step' (TAS) towards the high-level goal."
        }
    ],
    "steps": [
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Deconstruct the high-level goal into core technical requirements: defining API interaction protocols, creating a dedicated API communication module, and refactoring existing application logic to use the new module."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Define the precise JSON request bodies, headers, and prompt structures required to interact with the https://ai.violass.club/v1 API for the specific tasks of joke generation, feedback analysis, and recommendation."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Develop a dedicated, reusable API client module within the Humor Evaluator system to handle all communications with the https://ai.violass.club/v1 endpoint, encapsulating logic for authentication, request sending, and response parsing."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Integrate the new API client by refactoring the existing joke generation, feedback analysis, and recommendation features, replacing all previous LLM calls with calls to the new module."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Design a simple and clear UI layout for displaying the API-generated jokes, the results of the feedback analysis, and the final recommendations, ensuring the flow is intuitive for the user."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Implement the UI designs from Aurora, connecting the front-end components to the backend services that now use the new API, ensuring data is displayed correctly."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Perform end-to-end testing on the integrated system to evaluate the quality of the API's output. Refine the prompts for joke generation, analysis, and recommendations based on test results to optimize performance and relevance."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Apply final code modifications based on Lyra's testing and prompt refinement feedback, addressing any bugs or performance issues to finalize the implementation."
        }
    ]
}