{
    "roles": [
        {
            "title": "Designer",
            "description": "Generate aesthetic layouts, color palettes, typography, and UI flows, ensuring accessibility and visual balance."
        },
        {
            "title": "Engineer",
            "description": "Implement designs into clean, modular, and performant code, focusing on responsive design and accessibility."
        },
        {
            "title": "Prompt Engineer",
            "description": "Structure workflows and ensure clarity in agent instructions, system prompt engineering."
        },
        {
            "title": "Task-Agnostic Step (TAS) extractor (flash)",
            "description": "Identify and return each 'Task Agnostic Step' (TAS) towards the high-level goal."
        }
    ],
    "steps": [
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Define the website's core purpose, target audience, and key user interactions with the AI system to establish a clear project scope."
        },
        {
            "name": "uTASe",
            "role": "Task-Agnostic Step (TAS) extractor (flash)",
            "task": "Analyze the project scope to extract a comprehensive list of Task-Agnostic Steps required for creating the AI frontend."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Create low-fidelity wireframes and user flow diagrams based on the defined scope, focusing on intuitive navigation and interaction layout."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Develop a high-fidelity design system, including color palettes, typography, and interactive UI mockups for all website components."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Set up the frontend development environment, including the project structure, framework, and necessary build tools."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Translate the high-fidelity mockups into responsive, accessible, and modular UI components using clean code."
        },
        {
            "name": "Lyra",
            "role": "Prompt Engineer",
            "task": "Design the API contract and prompt structures for frontend-to-AI communication, defining how requests are made and responses are handled."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Implement the logic to connect the frontend to the AI system's API, managing application state (e.g., loading, data, errors) effectively."
        },
        {
            "name": "Aurora",
            "role": "Designer",
            "task": "Conduct a design review of the implemented frontend to ensure it aligns with the mockups and provides a high-quality user experience."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Perform final testing, including cross-browser compatibility checks, performance optimization, and bug fixing based on team feedback."
        },
        {
            "name": "Kodax",
            "role": "Engineer",
            "task": "Deploy the completed and tested website to a production server, ensuring it is live and accessible to users."
        }
    ]
}